{"writings":[
	{"bad":[
		{
			"blogTitle":"The diary of serial killer",
			"postTitle":"Eternal Hate",
			"post":"
				I’ve been trying to control myself. I have no reason why, but I wanted to observe how addicted I am. Never try this at home. It’s not worth it.
		
				I’m a monster (for the others), addicted to death, a vampire fed by pain and suffering. That’s who I am, who I always will be.
				I wanted to put it on a try, to see how it’s like to be “normal”, as you call it. I’m not. I am who I am. And that’s what I’m meant to be.
				
				First week it was ok, I thought it was not that hard. Second week I almost succumbed. Forth week I would kill anything that moves. And that’s what I did.
				
				I killed the first one I saw. And it was SO good. I had the deepest regret to put me on a try. What I was thinking? I’ve always been like this, I can’t change now, and I don’t want to.
				
				So what many people hate me, even not knowing who I am? So what it’s against the law, who made the laws anyway? So what I end with families, dreams and futures. That’s who I am. My hate, my hunger, myself, will always be with me. Eternally."
		},
		{
			"blogTitle":"The diary of serial killer",
			"postTitle":"Back in bloody red: new torture method",
			"post":"
				I didn’t feel like writing these past days, that’s why I didn’t. Writing this journal is a challenge: with it I defy the law and anyone who wants to find me. Even though I have been successful with my murders and staying away from jail.
				But with my routine available to everyone I never know how far my readers have got, so sometimes I feel like I’m being observed and I have to stay low profile. It can always be the police, that secret organization, or just a reader after me.
				
				But staying low profile for me doesn’t mean to stop killing. I never stop.
				And the easiest ways don’t work for me.
				I have already heard some people talking about killing bums, homeless people or hookers to get away easily. For me it doesn’t work. A murder for me is not just a life taken: what satisfies me is the planning process, the challenge, the reaction of the victim, and yes, the murder itself. But with time I realized that it all together is what really fulfills me. People already dead for society or not fully conscious don’t really matter to me. I would do them a favor.
				
				Well, all that is just to say that I had some real fun these days, even though I felt I was being observed.
				I would like to register one special torture method I used that I enjoyed.
				
				I captured someone and tied him to a chair at my torture room, in front of a mirror.
				This time I used a chainsaw. Surprisingly, I’d never used it before.
				I started with his legs, cutting both of them off. But not in just one piece.
				First, I’ve cut just the feet, then half of the shank, then at the knee level, and finally half of the thigh. I did it with both legs.
				After the legs, I went to the arms. Same thing: I’ve cut it off in four steps.
				Every time he passed out, I used a substance to wake him up, and just continued after he was fully awake. He watched every single step of his dismembering. You should see his horror face.
				And before he died, I divided his head in half, using the chainsaw as well, cutting from the chin to the brain, very slowly.
				
				The problem was to clean all the blood after that. But I was prepared."
		},
		{
			"blogTitle":"Fifth Nail",
			"postTitle":"Still Confused",
			"post":
				"My blog entries lately are erratic and full of a lot of B.S., for that I apologize. I am just trying to put down what is in my head, regardless. As far as 'taking people with me' well, I don't know if that is right or wrong. In fact, I don't know much any more what right and wrong even is. My view is either everything is right (in some regard) or everything is wrong (in some other regard). The question (one I am struggling with at this point) is, 'Does it matter?'
				Does anything matter? My mother is crying right now, because her son is in trouble again. She tried to raise a good son, and she knows her son has a good heart, so why does he do these things? She is probably more hurt and confused than me. Does it matter? It hurts me to know these things, but DOES IT MATTER???
				A hundred years from now, all my mothers pain will be forgotten, and other mothers will cry for there sons. A million years from now there probably won't be any mothers (at least not like we know).
				I have feelings, in fact I think I must be more sensitive than most people because I seem to feel more than they do, at least more than what they openly express. I feel for the starving children and families in the world, others say, 'Oh, that's too bad, but I can't do anything so...'
				I wish I could be more honest about my feelings, but those demons made sure I'd never be able to do that. I might not know if it matters, but just in case, I am working on an encrypted journal that is hundreds of times more frank than this blog could ever be (that's why I keep it encrypted). I figure in 30 years or more we will have the technology to easily crack the encryption (currently very un-crackable, PGP) and then the world will know who I really was, and what I really did, and what I really thought. Also, maybe then they will understand that despite my actions, I'm not a bad person, I just have a disease contracted from society, and it hurts a lot.
				I hope to complete this journal before I die (soon) or turn myself in (I still might do that, I think it is the right thing, but of course, I'm not sure).
				Speak of being sure; I wish I could be sure about my thoughts. But right now the only thing I'm sure about is that I'm sure about nothing. It is not a good position to be in considering my circumstances (being a felony fugitive and all)."
		},
		{
			"blogTitle":"Fifth Nail",
			"postTitle":"The Deams Have Taken Over",
			"post":
				"Thanks for the comments. As far as letting God take care of the Demons, too late. They've locked up the 'Happy Joe' person in the same dungeon that 'Happy Joe' kept them in for so many years. Now they are loose and I am very afraid. From now on I may refer to 'Happy Joe' as 'Jet' (me) and the demons as 'The Bogeyman.' If you are familiar with me or even my fifthnail website then you will understand the names (see www.fifthnail.com).
				I have been asking God to help defeat the demons. In fact, last night I was on my knees begging him, crying out loud to him, to help me. He didn't answer, again. The problem is I am loosing my religion. I don't accept anything at face value, not even my own thoughts. So when I start having religious convictions I question the source. And in my current situation I figure I am under a lot of stress, and there are perfectly natural human mechanisms that account for all religious experiences. The demons (if that's what they/it are/is--I use the term for mere convenience) have convinced me that I should at least question my religious beliefs, (this makes sense, otherwise I would believe anything) and that is how they got the key to the dungeon, and trapped me inside.
				To be more specific, I am scared, alone, and confused, and my reaction is to strike out toward the perceived source of my misery, society. My intent is to harm society as much as I can, then die. As for the 'Happy Joe' (Jet), well he was just a dream. The bogeyman was alive and happy long before Happy Joe.
				I was in prison for over 18 years, since the age of 17. As an adult all I knew was the oppression of incarceration. All those years I dreamed of getting out...And getting even. Instead, I got out and I got even, but did not get caught. So, I got even again, and again did not get caught. So, I figured, well, I got even twice (actually more, but that's here nor there), even if I'm the only one who knows, so now what? Well that was when the 'Happy Joe' dream started. I met a bunch of really great people, the kind of people I didn't even know existed, but here they were, bunches of them, my neighbors, my landlords, my professors, my coworkers, and they were all good people, who were willing to give me a chance despite my past. They were willing to accept me and be my friend, something that was new for me, having been betrayed by many 'friends' and even my own family.
				So, I tried to make it work. But the problem was those demons. The ones who 'got even' for me. They kept reminding me that if my new 'friends' knew about them (and what they, I, had done to even), then so much for their friendship. So, 'Happy Joe' was just dreaming, or pretending to be happy. "
		}
	]}
	{"good":[
		{
			"blogTitle":"The Pursuit of New Terrain",
			"postTitle":"",
			"post":"
				Sitting in a hotel in Nelson, freshly devastated by a farewell to Lucy, I am finally realizing how close I am to the end of this chapter of my life.
		
				To reflect back on the past few days, it has been a whirlwind of adventure.
		
				Day seven of our roadtrip was primarily a driving day. We left our hostel in the morning and hit the road for a hot 6.5 hours to Nelson. It was a pretty brutal drive. We got into Abel Tasman pretty late, hiked a quick 2k into the first campsite, and settled down for the night. At our first campsite, we realized we were incredibly low on fuel for our stove, so we ate a stunningly disgusting pasta with alfredo, and went to bed.
		
				Day eight, we woke up, had a lazy morning, and hit the trail. The track itself was mostly a flat, winding, jungle track, with occasional glimpses of the oasis that lay below us. The water was that kind of blue-green-cerulean that you only think exists in books. We hiked an easy 15k and settled down on the beach, laying out in the sun, and falling asleep in our tent to the waves lapping against the shore, growing only with the increase of the tidal pools. When cooking dinner, we immediately ran out of gas, and had to improvise some hot water. Fortunately, the track is much more populated than any other great walk I've seen, so we could snag some boiling water out of a lodge.
				
				Day nine, we woke up even later, and headed out on our final day of hiking of this grand adventure. Unlike the first day, the second day brought a much higher number of long climbs and descents, bringing us down to the beaches. We flew through it, despite the newer challenged, and finished the 15k much earlier than expected. We again set up camp next to the beach. This time, there was no lodge to steal water from, so we illegally built a fire on the beach and heated up our pasta the old fashion way. Nothing like sandy tortellini to make you miss the front country. By day nine, we were absolutely exhausted, and were pretty excited to get to sleep.
	
				Day ten, we woke up and sat on the beach, watching the kayakers come in and out of the bay. The beach was especially beautiful. 
	
				We climbed around on the rocks and played in the water as we waited for our water taxi (the luxury). We caught the boat around 11:15 and headed back to Marahau. It was our final day in the back country and we were escorted all the way back to the base on a boat. It was gorgeously hot, and we sat in the back of the boat drenched in naked sunlight, drinking in the salty sea air, and oh, what a joy it was to be so very much alive in that moment. I took a moment to reflect on our wonderful road trip and previous semester. The trip was full of adventure, and those kind of full body laughs that take you over, and make you pause in the middle, just to realize how exceptionally happy you are. 
	
				From Abel Tasman, we drove to Nelson, and stayed in this adorable B&B, and ran small errands.
	
				Day eleven, and our final day together, we sold our car and checked into another hotel. We had to say goodbye to Lucy around 3, our adored Brit, which broke my heart. Tonight, Bridget and I are waiting to go to dinner, enjoying a nice bottle of wine on our porch, over looking the city of Nelson.
	
				While I am excruciatingly excited to begin my next and final adventure, a 15 day NOLS Keelboat Sailing course, where I'll be living on a 38' sailboat with a bunch of new people I've yet to meet, I am truly saddened to be closing this chapter of my life. That being said, I am extraordinarily grateful to have gotten the opportunity to have experienced all of it, to have fallen madly in love with a country, a culture, and all of these people. It is stunning to be wrapping it up, when I feel like I have only just gotten here. I have been full with elation since I stepped into this country, and I will be leaving it with the same feeling. 
	
				See you in two weeks, internet. Wish me luck and easy sea legs. 
			"
		},
		{
			"blogTitle":"The Pursuit of New Terrain",
			"postTitle":"",
			"post":
				"I am nowhere near ready to leave.
		
				It is my last day in Dunedin. My suitcase is packed, my walls are stripped, my flatmates are dwindling, and I am full of a hopeful sort of sadness.
		
				 I neglected the blog for a little during exam week because 1. I had to attempt to study (watch all of Parks and Rec.), and 2. nothing fun or exciting happened. Except halloween, which was also the rugby world cup. The All Blacks won, and the house across the street streamed it on a projector on their house and there were like 25 couches outside. When they won, they burned all the couches, and started a massive riot. 
		
				Other than that, it was pretty much a standard (extremely long) exam period. But I finished my semester on November 2. So that was pretty weird. Since then, I've been aimlessly flailing around waiting for my friends to finish their exams and getting my life together.
		
				Tomorrow, Bridget, Lucy, Mia, and I leave for a 10 day road trip around the South Island. Mia is leaving us after a few days, but the other 3 of us will weave our way up the west coast until we get up to Nelson. We'll be alternating between back country and front country, and I'm really looking forward to it. Following the road trip, I embark on my 15 day NOLS keelboat sailing course, and then I return to the U.S., only to bumble and barrel through it before finally returning to where my roots lie - the beautiful and whimsical New Hampshire. 
		
				As for Dunedin, I am devastated at the prospect of leaving. This beautiful, lively, quirky city stole my heart, and will always be home to me. And the incredible, ethereal souls that came into my life here have changed me forever and will be in my heart wherever I am. It is amazing how little time we have spent here, and how quickly it went by, because I have forged some of the strongest relationships with terrific people, who have filled my life with such joy and light. I will miss this city and these beautiful people so much. 
		
				I assumed I would have more to say about this place, and the way it has brought me such happiness, consciousness, zen, love, bliss, wanderlust, etc. I also assumed I would have more to say about the people here. But frankly, I cannot give the way I feel about this city, this country, these people, words. My spirit will carry what I have learned here back home, and bits of my love will be buried in the mountains here. And I imagine these magical humans know that they have left me absolutely starry eyed, head over heels in love with you goons. A quick s/o is in order for my beloved Trash Squad. I have enjoyed every moment of being obsessed and spiritually intertwined with you brilliant, nuanced, stunning, hilarious trashcans of women. 
		
				Thank you, Dunedin. Thank you, University of Otago. Thank you to the internationals who never let me feel homesick, and thank you to the kiwis who accepted us with open arms and made New Zealand feel like home for us too.
		
				Wish me luck in my adventures, I'll be back in the U.S. December 3."
		}
	]}
]}