{
    "writings":
        {
            "bad":
            [
                {
                    "blogTitle":"The diary of serial killer",
                    "postTitle":"Eternal Hate",
                    "post":"I’ve been trying to control myself. I have no reason why, but I wanted to observe how addicted I am. Never try this at home. It’s not worth it. I’m a monster (for the others), addicted to death, a vampire fed by pain and suffering. That’s who I am, who I always will be. I wanted to put it on a try, to see how it’s like to be “normal”, as you call it. I’m not. I am who I am. And that’s what I’m meant to be. First week it was ok, I thought it was not that hard. Second week I almost succumbed. Forth week I would kill anything that moves. And that’s what I did. I killed the first one I saw. And it was SO good. I had the deepest regret to put me on a try. What I was thinking? I’ve always been like this, I can’t change now, and I don’t want to. So what many people hate me, even not knowing who I am? So what it’s against the law, who made the laws anyway? So what I end with families, dreams and futures. That’s who I am. My hate, my hunger, myself, will always be with me. Eternally."
                },
                {
                    "blogTitle":"The diary of serial killer",
                    "postTitle":"Back in bloody red: new torture method",
                    "post":"I didn’t feel like writing these past days, that’s why I didn’t. Writing this journal is a challenge: with it I defy the law and anyone who wants to find me. Even though I have been successful with my murders and staying away from jail. But with my routine available to everyone I never know how far my readers have got, so sometimes I feel like I’m being observed and I have to stay low profile. It can always be the police, that secret organization, or just a reader after me. But staying low profile for me doesn’t mean to stop killing. I never stop. And the easiest ways don’t work for me. I have already heard some people talking about killing bums, homeless people or hookers to get away easily. For me it doesn’t work. A murder for me is not just a life taken: what satisfies me is the planning process, the challenge, the reaction of the victim, and yes, the murder itself. But with time I realized that it all together is what really fulfills me. People already dead for society or not fully conscious don’t really matter to me. I would do them a favor. Well, all that is just to say that I had some real fun these days, even though I felt I was being observed. I would like to register one special torture method I used that I enjoyed. I captured someone and tied him to a chair at my torture room, in front of a mirror. This time I used a chainsaw. Surprisingly, I’d never used it before. I started with his legs, cutting both of them off. But not in just one piece. First, I’ve cut just the feet, then half of the shank, then at the knee level, and finally half of the thigh. I did it with both legs. After the legs, I went to the arms. Same thing: I’ve cut it off in four steps. Every time he passed out, I used a substance to wake him up, and just continued after he was fully awake. He watched every single step of his dismembering. You should see his horror face. And before he died, I divided his head in half, using the chainsaw as well, cutting from the chin to the brain, very slowly. The problem was to clean all the blood after that. But I was prepared."
                },
                {
                    "blogTitle":"Fifth Nail",
                    "postTitle":"Still Confused",
                    "post":"My blog entries lately are erratic and full of a lot of B.S., for that I apologize. I am just trying to put down what is in my head, regardless. As far as 'taking people with me' well, I don't know if that is right or wrong. In fact, I don't know much any more what right and wrong even is. My view is either everything is right (in some regard) or everything is wrong (in some other regard). The question (one I am struggling with at this point) is, 'Does it matter?' Does anything matter? My mother is crying right now, because her son is in trouble again. She tried to raise a good son, and she knows her son has a good heart, so why does he do these things? She is probably more hurt and confused than me. Does it matter? It hurts me to know these things, but DOES IT MATTER??? A hundred years from now, all my mothers pain will be forgotten, and other mothers will cry for there sons. A million years from now there probably won't be any mothers (at least not like we know). I have feelings, in fact I think I must be more sensitive than most people because I seem to feel more than they do, at least more than what they openly express. I feel for the starving children and families in the world, others say, 'Oh, that's too bad, but I can't do anything so...' I wish I could be more honest about my feelings, but those demons made sure I'd never be able to do that. I might not know if it matters, but just in case, I am working on an encrypted journal that is hundreds of times more frank than this blog could ever be (that's why I keep it encrypted). I figure in 30 years or more we will have the technology to easily crack the encryption (currently very un-crackable, PGP) and then the world will know who I really was, and what I really did, and what I really thought. Also, maybe then they will understand that despite my actions, I'm not a bad person, I just have a disease contracted from society, and it hurts a lot. I hope to complete this journal before I die (soon) or turn myself in (I still might do that, I think it is the right thing, but of course, I'm not sure). Speak of being sure; I wish I could be sure about my thoughts. But right now the only thing I'm sure about is that I'm sure about nothing. It is not a good position to be in considering my circumstances (being a felony fugitive and all)."
                },
                {
                    "blogTitle":"Fifth Nail",
                    "postTitle":"The Deams Have Taken Over",
                    "post":"Thanks for the comments. As far as letting God take care of the Demons, too late. They've locked up the 'Happy Joe' person in the same dungeon that 'Happy Joe' kept them in for so many years. Now they are loose and I am very afraid. From now on I may refer to 'Happy Joe' as 'Jet' (me) and the demons as 'The Bogeyman.' If you are familiar with me or even my fifthnail website then you will understand the names (see www.fifthnail.com). I have been asking God to help defeat the demons. In fact, last night I was on my knees begging him, crying out loud to him, to help me. He didn't answer, again. The problem is I am loosing my religion. I don't accept anything at face value, not even my own thoughts. So when I start having religious convictions I question the source. And in my current situation I figure I am under a lot of stress, and there are perfectly natural human mechanisms that account for all religious experiences. The demons (if that's what they/it are/is--I use the term for mere convenience) have convinced me that I should at least question my religious beliefs, (this makes sense, otherwise I would believe anything) and that is how they got the key to the dungeon, and trapped me inside. To be more specific, I am scared, alone, and confused, and my reaction is to strike out toward the perceived source of my misery, society. My intent is to harm society as much as I can, then die. As for the 'Happy Joe' (Jet), well he was just a dream. The bogeyman was alive and happy long before Happy Joe. I was in prison for over 18 years, since the age of 17. As an adult all I knew was the oppression of incarceration. All those years I dreamed of getting out...And getting even. Instead, I got out and I got even, but did not get caught. So, I got even again, and again did not get caught. So, I figured, well, I got even twice (actually more, but that's here nor there), even if I'm the only one who knows, so now what? Well that was when the 'Happy Joe' dream started. I met a bunch of really great people, the kind of people I didn't even know existed, but here they were, bunches of them, my neighbors, my landlords, my professors, my coworkers, and they were all good people, who were willing to give me a chance despite my past. They were willing to accept me and be my friend, something that was new for me, having been betrayed by many 'friends' and even my own family. So, I tried to make it work. But the problem was those demons. The ones who 'got even' for me. They kept reminding me that if my new 'friends' knew about them (and what they, I, had done to even), then so much for their friendship. So, 'Happy Joe' was just dreaming, or pretending to be happy. "
                },
                {
                    "blogTitle":"Dennis Nilson",
                    "postTitle":"Autobiography",
                    "post":"This short study is not a full autobiography. It is a narrative compilation including what I believe to be the salient features of my Sexual History. The only serious attempt to interpret my life was the book by Brian Masters, Killing for Company. However, my autobiography, ‘History of a Drowning Boy’ (written in 1988/89) has never been published and, thereby, my exposition of myself in full studied detail has not seen the light of day.  Every author is entitled to his interpretation of a subject but one is not obliged to agree with his conclusions.  I have spent almost nine years in a climate of long and detailed introspection, without counselling or therapy of any positive kind. Therefore it has fallen on me to prove the secret recesses of my personality in the hope that I may understand the engine of my actions and effect solutions to problems in a non-destructive way. In this short study I offer my own conclusions at the end. In measuring the spectrum of human conduct, none of us can, as yet, simplify mans infinitely varied behaviour into a set of definitive answers. All we can hope to do is gather and interpret as many of the common traits and features with a view to help us understand humanity better than ignorance and prejudice.  I apologise in advance for the state of this first draft manuscript. I did no rough notes in longhand but put the recollections that came to mind straight from the mind onto this typewriter. As I was under the pressure of having to produce so much in such a short time (three weeks) and at moments when I was not engaged on other things. The entire text is replete with typing slips, errors and omissions due to the sheer speed of production. I have barely had time for anything other than a quick read over of what I have produced. It is not a full study because of the tight time factor but I trust it will be helpful in understanding the long road from childhood to the present day. I have tried not to replicate or repeat material I have produced in my Brixton prison journals of 1983. The narrative ends in 1985 because since then there has been practically no sexual element in my life. The second reason is that any man has a right to some recent privacy. Suffice to say that my sexuality today has in it no element of violence against other persons. I have not felt attracted to anyone sexually since I left Wakefield Prison in early April 1990.  I hope this document will assist the reader in understanding the Orientation in my past life. This is comprehensive and I have held nothing, that springs to mind, back. I am willing to answer any questions not answered herein. "
                },
                {
                    "blogTitle":"Letters from David",
                    "postTitle":"The Everlasting Arms",
                    "post":"I have been weak and weary, not only from the oppressive heat and humidity, but, moreover, from the intense spiritual warfare which has been taxing my mind, body and spirit. Yet God has been faithful to carry me through.  For even in my tiredness and exhaustion the grace of God shows itself to be sufficient. Like the popular poem, “Footprints in the Sand,” just when I think I am all alone and I could no longer press onward, I instead discover that the “everlasting arms” of Christ are holding me up. But aside from this, I believe the Lord has been revealing to me that it is time to speak as well as go even deeper into enemy territory. Frankly I cannot say that I am ready for any new challenges and assignments.  My fatigue has been keeping me in my comfort zones and glad to be standing on familiar ground.  Yet this is not the Lord’s way. Jesus has been preparing me, I am certain, for more service.  Still I confess that in spite of the divine call, I never feel quite ready nor capable. Nevertheless, like any Christian, I must step out in faith.  I must hope the right decision was made, and then give it all to the Lord."
                },
                {
                    "blogTitle":"Letters from David",
                    "postTitle":"I had such wonderful parents",
                    "post":"I have a great and tenderhearted father.  I don't think there is a dad like him throughout the world.  There are days, even at this moment, that I miss my father so much I can actually feel an ache in my heart.  I thank the Lord that, with all the bad things I have done in the past, and all my failings and mistakes, my Dad still loves me.  He has stuck with me. To be honest, I put my father through hell.  I'm not only referring to acts which caused me to come to prison, as horrible as these things were.  But ever since I was a young child I had a wild and rebellious streak. My parents, just simple middle class Jewish folks, poured so much love in my life.  My father had to struggle to make a living working in a little neighborhood hardware store, six days a week. Ten hours per day.  He had to stand up for hours and would come home exhausted.  He worked hard and was always honest in his dealings with others.  My Dad was always so mild mannered.  I don't believe I ever saw him in an arguement.  Everybody liked my father. But, dumb me, I just didn't appreciate him. There were good times.  I remember going to school across the street from our apartment building where my Dad and I would sometimes play catch with a softball.  He would fix my bike when he could.  I remember playing Monopoly with my parents on an occasional Sunday afternoon. We had our fun times when Dad would take me bowling, or he would take me out for ice cream on those hot summer nights.  There was a local candy store where we went for ice cream cones, and sometimes we went to Cavel for custard sundaes. As much as my parents cared, it was beyond their ability to understand---they could not have comprehended my suicidal thoughts--.  It was not their fault.  I never shared my feelings with them.  My Dad would plead with me to open up to him, but I never really did. I remember the times I saw him break down and cry when I was cruel to him.  I remember how he struggled to care for me when my mother got cancer in 1967 and ended up in the hospital  She would die in this year, too. At age fourteen, I was staying out late at night and running with a bad crowd.  I know my Dad still remembers the first time I came home drunk and puking all over the bathroom floor, missing the toilet.  He was very upset with me.  Yet no matter how much he begged me to stay off the streets, I was set in my rebellious ways and would not listen to him. Today I have a lot of guilt seeing how I mistreated him.  I know he deserved better than me for a son.  I truly believe this. Today I can truly thank God Almighty for the father I have.  Like my Heavenly Father, my Dad's love for me has been unconditional.  He has loved me when I was good and also when I was bad.    All these years later my father has stuck by me.  Only true love could manage this. He's in his nineties now.  I don't know when I will ever see him again face to face.  However I can carry my Dad's love in my heart, and this is good enough. 'Happy Father's Day, Dad.  I love you.' (I am thinking) a lot about my mother, Pearl, and how much I love and miss her, and how I long to see her again. I was fourteen when my Mother died from cancer in 1967.  Although she left this earth so many years ago, I miss her tremendously.  Not a day goes by that I do not think of her. I had a great Mother.  But I was to immature, and I had to many inner struggles and emotional problems back then to really get close to people, even to my own parents. I was a moody and aloof child.  I had caused my parents much grief by the way I had misbehaved, and by the way I treated them.  I regret this so much. Now that I was finally able to grow up--and this was when I was already in prison--I have been able to see, understand, and appreciate the wonderful worth of my parents and the depths of their love for me. She was a fantastic knitter.  She worked wonders with wool and her knitting needles.  Many of her friends and neighbors would beg Mom for the colorful Afgan blankets she created. My mother was a priceless treasure."
                },
                {
                    "blogTitle":"Letters from David",
                    "postTitle":"Suffering Service",
                    "post":"Many of God's servants have endured tremendous suffering at the hands of His enemies.  They were rejected, persecuted, and lied about by people who took their hatred out on God's children. Jeremiah the prophet, for instance, was often scorned in public.  John the Baptist was beheaded by a king.  The apostle John was banished to a barren island, while saint Paul was beaten frequently.  Trials, tribulations and tests of their faith came often.  And each of them got to know suffering in its various forms:  physical, emotional, and spiritual.  Yet they endured all things because they trusted in the One Who had promised never to forsake them not even in the most difficult hours.  These forerunners walked not by what they could see with their natural eyes, but through spiritual eyes they journeyed along the bright path of faith. Therefore, if we, as believers in Messiah Jesus are to survive in a world with its betrayals and cruelties, we too must set our sights and affections on heavenly things.  We need to have confidence in all that God has promised to those who love Him.   For the same Lord who was with them, is with us today."
                },
                {
                    "blogTitle":"Letters from David",
                    "postTitle":"Open Hearts",
                    "post":"I am continuing to  regain my strength.  My heart is fixed upon God, and I am filled with anticipation for the future, both in the coming months, and in the year ahead. During yesterday’s worship service I was able to speak for about twenty minutes, before the main preacher came forward, on the subject of trusting in the Lord. I read Proverbs 3:5,6 to the congregation.  I then began to tell them what I believed the Lord wanted me to say I know from the responses I received afterwards that most of the men were encouraged.  Others, frankly, are never helped or encouraged no matter what may be said from beind the pulpit, or who may be speaking.  Nevertheless, at the close of our service the altar was crowded with men. My chaplain was able to pray for each of them But  what has especially filled my heart with joy this past week is the good and open responses I’ve been getting from two young men who live in my cell block One is a black man from Buffalo, New York.  The other is a Hispanic man from Brooklyn.  Both are involved in gangs.  And both want to disassociate themselves from these gangs.  Sadly, to me they already look like burned out soldiers who somehow managed to survive to  many wars The black fellow lost one of his eyes in a fight while he was in another prison.  His right eye was gouged out by another inmate who jumped him.  Now he’s been learning to survive with one good eye, and an unsightly black patch that hides the hole where his other eye had been He also told me that six members of his family have been lost to violence, in and around the city of Buffalo, all within the past several years He has a wife who’s doing time in a county jail.  His five children are currently being raised by various relatives.  But the nice part for him is that he is doing a prison sentence of only several years. And because his time is almost up, he’s hoping for a January release.  As for the Hispanic man, he’s been involved with “the Bloods” gang since he was a teenager.  He’s been going to our Sunday morning chapel services, however, as well as reading the Bible.  So, very soon, I pray, he will make that step of faith and surrender to Jesus Christ God’s light, I believe, does indeed shine the brightest in these dark places of the world.  He is opening hearts even behind prison walls."
                },
                {
                    "blogTitle":"Letters from David",
                    "postTitle":"Letter to the Governer",
                    "post":"I am writing to you with regards to my parole hearing which is scheduled for June 2002. Sir, I am so sorry for the pain, grief and suffering I have caused many innocent people by my criminal acts of some twenty-five years ago.  am haunted by my actions and I would do anything to undo this tragedy.  I know that I have failed and disappointed  my loving family, and I disgraced myself for the rest of my life. However today, because of Jesus Christ and my faith in Him, I am trying my best to make amends to society in any way that I can.  I am thankful for whatever opportunities which come my way to do this. Also, as you know, last month, there was a burst of media coverage concerning this hearing.  Unfortunately, no one from the media had asked for my opinion about the matter. And so with all due respect to you and to New York State's citizens, and with respect to the families who lost a loved one, and to those who were seriously wounded. I wish to share my thoughts about parole.  I believe this will help to ease your concern and theirs. I am disappointed that there is even going to be a parole hearing.  I know that the sentencing laws require a hearing to be held in June, a date which was set twenty-five years ago.  But the fact is, I have absolutely no interest in parole. I have done nothing whatever to try to obtain parole.  For example, I have never asked anyone be they a friend or minister, to write a letter of support in my behalf.  Likewise I have never asked any prison officials to write letters to recommend me for release.  I do not believe in doing such things.  Frankly, I can give you no good reason why I should even be considered for parole.  I can, however, give you many reasons why I should not be.  The loss of six lives and the wounding of even more are reasons enough for the latter. In all honesty, I believe that I deserve to be in prison for the rest of my life.  I have, with God's help, long ago come to terms with my situation and I have accepted my punishment.  God has given me peace about this.  My faith has helped to put the past behind me, and to always pray for those I have hurt, and for those who are still greiving till this very day. Sir, it is so tragic and regrettable that the families of my victims have to go through more suffering.  Right now they're filled with anger, anxiety and pain because they think I am trying hard to get out of prison.  But this is simply not true. Governor Pataki, these people have nothing to worry about.  For, if and when I go to this hearing, it will only be to show respect to the parole board, to apologize and take responsibility for my criminal actions, and to basically tell them what I am now telling you---that I do not deserve parole. Thank you, your honor, for taking the time to read my letter.  I hope it has brought some clarity to the matter.  I pray dearly that those families will be able to have some peace and closure very soon."
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":""
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
            ],
            "good":[
                {
                    "blogTitle":"The Pursuit of New Terrain",
                    "postTitle":"",
                    "post":"Sitting in a hotel in Nelson, freshly devastated by a farewell to Lucy, I am finally realizing how close I am to the end of this chapter of my life. To reflect back on the past few days, it has been a whirlwind of adventure. Day seven of our roadtrip was primarily a driving day. We left our hostel in the morning and hit the road for a hot 6.5 hours to Nelson. It was a pretty brutal drive. We got into Abel Tasman pretty late, hiked a quick 2k into the first campsite, and settled down for the night. At our first campsite, we realized we were incredibly low on fuel for our stove, so we ate a stunningly disgusting pasta with alfredo, and went to bed. Day eight, we woke up, had a lazy morning, and hit the trail. The track itself was mostly a flat, winding, jungle track, with occasional glimpses of the oasis that lay below us. The water was that kind of blue-green-cerulean that you only think exists in books. We hiked an easy 15k and settled down on the beach, laying out in the sun, and falling asleep in our tent to the waves lapping against the shore, growing only with the increase of the tidal pools. When cooking dinner, we immediately ran out of gas, and had to improvise some hot water. Fortunately, the track is much more populated than any other great walk I've seen, so we could snag some boiling water out of a lodge. Day nine, we woke up even later, and headed out on our final day of hiking of this grand adventure. Unlike the first day, the second day brought a much higher number of long climbs and descents, bringing us down to the beaches. We flew through it, despite the newer challenged, and finished the 15k much earlier than expected. We again set up camp next to the beach. This time, there was no lodge to steal water from, so we illegally built a fire on the beach and heated up our pasta the old fashion way. Nothing like sandy tortellini to make you miss the front country. By day nine, we were absolutely exhausted, and were pretty excited to get to sleep. Day ten, we woke up and sat on the beach, watching the kayakers come in and out of the bay. The beach was especially beautiful.  We climbed around on the rocks and played in the water as we waited for our water taxi (the luxury). We caught the boat around 11:15 and headed back to Marahau. It was our final day in the back country and we were escorted all the way back to the base on a boat. It was gorgeously hot, and we sat in the back of the boat drenched in naked sunlight, drinking in the salty sea air, and oh, what a joy it was to be so very much alive in that moment. I took a moment to reflect on our wonderful road trip and previous semester. The trip was full of adventure, and those kind of full body laughs that take you over, and make you pause in the middle, just to realize how exceptionally happy you are.  From Abel Tasman, we drove to Nelson, and stayed in this adorable B&B, and ran small errands. Day eleven, and our final day together, we sold our car and checked into another hotel. We had to say goodbye to Lucy around 3, our adored Brit, which broke my heart. Tonight, Bridget and I are waiting to go to dinner, enjoying a nice bottle of wine on our porch, over looking the city of Nelson. While I am excruciatingly excited to begin my next and final adventure, a 15 day NOLS Keelboat Sailing course, where I'll be living on a 38' sailboat with a bunch of new people I've yet to meet, I am truly saddened to be closing this chapter of my life. That being said, I am extraordinarily grateful to have gotten the opportunity to have experienced all of it, to have fallen madly in love with a country, a culture, and all of these people. It is stunning to be wrapping it up, when I feel like I have only just gotten here. I have been full with elation since I stepped into this country, and I will be leaving it with the same feeling.  See you in two weeks, internet. Wish me luck and easy sea legs."
                },
                {
                    "blogTitle":"The Pursuit of New Terrain",
                    "postTitle":"",
                    "post":"I am nowhere near ready to leave. It is my last day in Dunedin. My suitcase is packed, my walls are stripped, my flatmates are dwindling, and I am full of a hopeful sort of sadness.  I neglected the blog for a little during exam week because 1. I had to attempt to study (watch all of Parks and Rec.), and 2. nothing fun or exciting happened. Except halloween, which was also the rugby world cup. The All Blacks won, and the house across the street streamed it on a projector on their house and there were like 25 couches outside. When they won, they burned all the couches, and started a massive riot.  Other than that, it was pretty much a standard (extremely long) exam period. But I finished my semester on November 2. So that was pretty weird. Since then, I've been aimlessly flailing around waiting for my friends to finish their exams and getting my life together. Tomorrow, Bridget, Lucy, Mia, and I leave for a 10 day road trip around the South Island. Mia is leaving us after a few days, but the other 3 of us will weave our way up the west coast until we get up to Nelson. We'll be alternating between back country and front country, and I'm really looking forward to it. Following the road trip, I embark on my 15 day NOLS keelboat sailing course, and then I return to the U.S., only to bumble and barrel through it before finally returning to where my roots lie - the beautiful and whimsical New Hampshire.  As for Dunedin, I am devastated at the prospect of leaving. This beautiful, lively, quirky city stole my heart, and will always be home to me. And the incredible, ethereal souls that came into my life here have changed me forever and will be in my heart wherever I am. It is amazing how little time we have spent here, and how quickly it went by, because I have forged some of the strongest relationships with terrific people, who have filled my life with such joy and light. I will miss this city and these beautiful people so much.  I assumed I would have more to say about this place, and the way it has brought me such happiness, consciousness, zen, love, bliss, wanderlust, etc. I also assumed I would have more to say about the people here. But frankly, I cannot give the way I feel about this city, this country, these people, words. My spirit will carry what I have learned here back home, and bits of my love will be buried in the mountains here. And I imagine these magical humans know that they have left me absolutely starry eyed, head over heels in love with you goons. A quick s/o is in order for my beloved Trash Squad. I have enjoyed every moment of being obsessed and spiritually intertwined with you brilliant, nuanced, stunning, hilarious trashcans of women.  Thank you, Dunedin. Thank you, University of Otago. Thank you to the internationals who never let me feel homesick, and thank you to the kiwis who accepted us with open arms and made New Zealand feel like home for us too. Wish me luck in my adventures, I'll be back in the U.S. December 3."
                },
                {
                    "blogTitle":"anna does pangea",
                    "postTitle":"Ensuring Safer Delivery in Ndom: Ludi's Maternity Ward Project",
                    "post":"A little while back, my Peace Corps sister Ludi debuted one of her most impressive projects at post (and the girls had a lot of impressive projects!) -- a new maternity ward and education room at her health center. Ludi's village, Ndom, has a health center that serves a larger area, and many of the women from the outlying villages don't come to the center for prenatal consultations -- or to give birth. This is a problem that Ludi, her counterpart Matilda, and their care group -- composed of 20 women from villages around the health area -- set out to solve. Ludi applied for and received a VAST grant, which is funded by the U.S. President's Emergency Plan for AIDS Relief (PEPFAR). With it, they made the maternity ward more welcoming with a fresh coat of paint and a brand new birthing bed. They also added benches, tables, and a television to show educational videos from Medical Aid Films. Kevin, a PCV friend who lives in the East, came to teach the women how to make tofu and film a documentary about the opening and family planning measures. And the day after the opening, a woman came and had the honor of being the first one to give birth in the new room. Overall, it was a huge success, and I'm so proud of Ludi, Matilda, and the women's group!Also, reminder! The Peace Corps Cameroon 2016 calendar is now available for pre-order. We're hoping to sell 1000 and appreciate every sale! All photos and written content by Cameroon PCVs -- including Kevin, who photographed the cover -- and all proceeds go to projects in country! (And one month includes a written feature on Ludi's care group!)"
                },
                {
                    "blogTitle":"anna does pangea",
                    "postTitle":"Breaking Bread in Trombel",
                    "post":"A few days ago, I was working in the Tombel Public Library when a friend passed by. The library is super conveniently located -- you can literally see it from my front door -- and she was coming down from the other direction. When I asked her where she was coming from, she answered the bakery. I was sure I'd misunderstood her (she's francophone), because she was coming from a dead end with, to my knowledge, no bakeries. She continued to elaborate, using other vocabulary to explain that she'd been collecting a small deposit (she works for a credit union) from 'the place where they make bread.' So we went on a little field trip: her, me, and my counterpart Nkwelle. And we ended up at a bakery not three minutes from my house. I was totally blown away, which of course everyone found endlessly entertaining -- it was amazing! And it had been nestled into the side of my little mountain for almost two years! Luckily, they were smack in the little of baking a batch, and they let me watch, take photos, and gave me two free rolls at the end. I love that even after two years here, I'm still stumbling across new things, embracing local-as-it-gets production, and getting dashed rolls fresh out the oven."
                },
                {
                    "blogTitle":"Pearls From Africa",
                    "postTitle":"Heavy Mettle",
                    "post":"One of my favorite taglines to say around here is 'Uganda: Where Anything Is Possible' (second only to 'Uganda: The World Is Your Toilet'). Just when you think, 'There's no way that can work,' someone finds a way. This can be both a blessing and a curse. I've been stuffed in car taxis where the driver will manage to cram 10 people into a Toyota Corolla (this includes what I like to call a 'Siamese ssebo' or two people in the driver's seat) and someone literally sitting on the hood of a traveling car. Anything is possible! Bed frames to bicycles to other motorcycles carried on the back of a motorcycle. Anything is possible! Just stole over $60 million from the government in fraudulent road contracts? Again, anything is possible! This will be my last post as a Peace Corps Volunteer in Uganda. Last words are always the hardest to write, they are a time of self-reflection and lessons learned. I've struggled with how to reflect on my last two years here in Uganda. Anyone who has ever served in the Peace Corps knows that it can be one of the most challenging yet rewarding experiences. This sounds trite since everyone loves to quote 'The hardest job you'll ever love'. This has certainly been a tough two years, a time filled with self-doubt, frustration, personal loss and illness. But in the meantime, I've learned about self-reliance, flexibility and how to smile during difficult times. During my last week at school, I was talking with some of the teachers, who were curious about when I would start having children. I explained that I wanted to wait until I was in my 30s, giving Jim and I some time to enjoy married life. One of the teachers asked, 'But what about when Jim wants to have kids? He will decide.' We talked about how culturally a man in Uganda decides when he wants children and how many he wants. This was a stark reminder of several things: a) you learn something new everyday b) there are certain cultural aspects with which I will never be ok and c) I like sharing my point of view. I told my staff that with most American couples, they decide together when to start a family and the number of children. I also talked about how it's my body, therefore shouldn't a woman have the power to decide? There will just be some things we don't agree on, and I've finally learned that's alright I'm looking forward to visiting Uganda in a few years and seeing how things have developed. Uganda is one of the world's youngest countries, with over half the population under the age of 15. With this explosion in population, it will be interesting to see how politics and development progress in Uganda. I've learned countless lessons from Ugandans, including a whole new meaning of community, an unwavering faith in God, the true meaning of humility, and astounding resourcefulness and adaptability. "
                },
                {
                    "blogTitle":"Pearls From Africa",
                    "postTitle":"Know Your Status",
                    "post":"Last Saturday, we had the AIDS Information Center come to the PTC for a day of HIV information and testing. I worked with AIC Kabale to organize the event with all the students. We had a team of 6 come from AIC to facilitate sessions on HIV transmission and prevention, and a team of 20 living-positive drama members to perform skits for the students. They sang folk songs and performed skits in local language about the importance of wearing condoms, knowing your status and understanding the basics of HIV. The AIC did a great job of fielding questions from students, from everything about how to wear a condom to questions about unprotected sex. To assure anonymity, we had students submit written questions and then answered them in front of the student body. It was a really productive morning, especially since these students don't have a safe outlet to ask questions about their bodies, sex, masturbation, condoms. This is one reason that I love Peace Corps camps so much is that they provide that safe outlet for Ugandan youth. We also had to keep it PG at the PTC since the administration is vehemently against any talk about condoms or how to stay protected during sex. It makes it hard to give knowledge to students, many of which are sexually active or are at least curious about it. After lunch, the AIC set up a testing and counseling area for HIV testing. It was an optional activity but I am pleased to say that over half the student body tested for HIV, with only one testing positive for HIV. That is a great outcome, not only to have students test themselves but to have such a low rate of HIV among those tested. I count the day as a great success, especially spending the day with the PTC students and the great staff at AIC. "
                },
                {
                    "blogTitle":"1 Part Bleach, 3 Parts Sweat",
                    "postTitle":"How Ebola Stole Christmas",
                    "post":"Last night was the first night of Hannukah. Truthfully, I had no idea. For an East Coast resident, it’s hard to experience the excitement of the holiday season in a sweaty, tropical climate. December in my home-town calls up engrained visions of sugar plum faeries, stockings lining the mantle above a roaring fire, and blankets of white snow shrouding the town in stillness.  Yet here I find myself surrounded by beaches, palm trees, and the refreshing breeze of the Harmattan. Yesterday, I went into central Freetown on business. Babker, an IRC driver, and I began to talk about the current situation as we waited, stuck in rush hour traffic. We were hounded on either side of the vehicle by young men and women selling various goods – boxes of cereal, floor mats, ceiling dusters, chocolate cookies. I wonder just how many dusters are sold every day; it surely cannot be that many. I imagine it is a hard line of business and contemplate purchasing one. Babker draws me back in. He tells me that Christmas here is the most beautiful celebration in all of West Africa, assuring me that his nationality as a Sierra Leonean in no way biases his opinion. In the weeks leading up to the 25th, festivals fill the streets and lights and communal celebrations can be seen and heard from afar. We look out the window of the vehicle. Traffic remains at a standstill and a crowd of merchants has gathered, still waving those dusters attractively towards me. As Babker and I scan the city, we see no evidence of Christmas. The traditional signs wishing people a joyous and prosperous new year are replaced with signs warning us of the dangers of Ebola. Do not touch the sick. Do not wash bodies. Wash your hands. Avoid body contact. Christmas is cancelled this year. Ebola has stolen Christmas from a people who have already had so much stolen from them. Despite many months of dedicated work, quarantines, community sensitizations, and behavior change campaigns, Ebola is still strongly present in Sierra Leone. The government has announced the beginning of “Operation Western Area Surge” to encourage people to come forward if they have a fever or other symptoms of Ebola and to call the national hotline, #117, for help at an early stage. This operation also includes restrictions which are now in place for the holiday season to support the on-going efforts and coordination between government and international partners."
                },
                {
                    "blogTitle":"1 Part Bleach, 3 Parts Sweat",
                    "postTitle":"Smile of a Survivor",
                    "post":"I had the opportunity to meet 3 strong women — 3 survivors. They were at the IRC-run isolation unit in Masiaka interviewing for nursing and laundry work. They expressed to me their happiness and blessings at surviving but without work, things are difficult for them. As of December 28, there were 1,780 Ebola survivors in Sierra Leone. Survivors are about the only people in Sierra Leone you can hug and touch without any fear — you know they’re not infected! It is thought that immunity to the virus may last up to 10 years. The long-term effects of the illness are little known but joint pain and eye disorders are proving common. Ebola patients often lose everything — their family members who succomb to the illness, their personal items that are destroyed in the disinfection process, their place in the community as stigma takes hold. The fight against Ebola is long and hard and doesn’t end with a negative test result. These women will remain in my thoughts and prayers."
                },
                {
                    "blogTitle":"Senegal Writing Home",
                    "postTitle":"Haa Gongol",
                    "post":"I left my village for the last time yesterday. That’s a sentence I never thought would actually come. I feel as though I’ve lived a lifetime in the last two years, and, in a way, I have. When talking about my time in Senegal, a friend of mine once shared with me a quote by Walt Whitman that says, “O me, what I was for years, now dead (I lament not, I am content).” It’s one of those quotes I kept coming back to month after month, reflecting on, as I had new experience after new experience here. It’s not that I think I’ve changed drastically from the person I was when I arrived, but more as if I’ve solidified into the person I always had the potential to be. These two years have defined a part of me that was untested before. In a selfish way, I see it as the greatest gift being in the Peace Corps has given me. It’s a steel that wasn’t there before, a readiness to get out of life everything I want to. The physical goodbyes of yesterday, to my host family, work partners, and friends who have seen me through these last two years, was painfully difficult. We’ve been through so much together, not the least of which was their acceptance of an outsider into their homes and lives whom they took care of as their own. Recently, my friend Megan was in Yacine Lakke visiting. We were sitting under a neem tree with my host mom on a hot afternoon, discussing mine and Meg’s imminent departure from Senegal and how sad it would be to leave. My elderly host mom, in her enthusiasm to agree with that sentiment, pulled out her left breast from underneath her loose tunic dress and held it before Meg, gesturing between it and me. ‘Ko bi am,’ she said, ‘Ko mi muynii mo’. ‘That’s my daughter. I raised her’. Meg and I giggled (no matter how long you live here you never fail to be amused by the casual appearance of a grandmother’s breast during the course of a conversation) but we understood. My host mom was saying that I wasn’t just an American who showed up and worked there for two years; I was a part of the family, I was one of her own. It’s a very special thing to feel that loved by someone who didn’t have to care so much. It adds meaning to my time as a Peace Corps volunteer. Walking out of Yacine Lakke was hard, but walking out a stronger person than the one who came in was empowering. I’m forever grateful for the people and places in Senegal who made me the more resilient person I am today. I look back on the trainings I did, the programs I ran, and the projects I oversaw and only see the people who helped make them a reality by helping me, showing up, and being involved. Without those partnerships, and the bad times to really highlight the good times, I think the last two years would have felt empty. Back in the States, I have a Grandma Trudy, a truly spectacular and wise lady you should consider yourself blessed to meet, if you ever have the chance. She and I have a thing between us where neither can ever say ‘goodbye’ to the other. It’s too final. It leaves no room for possibility. We always say ‘see you soon,’ in place of it. So that’s the last thing I said to my host family and village before leaving because goodbye forever didn’t seem quite right. Instead I said, ‘haa gongol’. Until next time."
                },
                {
                    "blogTitle":"Senegal Writing Home",
                    "postTitle":"How Many Eggs Did She Buy?",
                    "post":"I meant to post this weeks ago so I apologize for the untimeliness but here it is. Another Ramadan has passed! I’m finally emerging from my semi-comatose state of the last few weeks (I decided to go out with a bang and do fasting properly this year, no water and no food) and I’m reminded again of the word that’s been rattling around in my head for the past few months now: community. As we celebrate the end of Ramadan for the third (!) day the interwoven threads of my village are at their most obvious. There is a community of reliance on one another like nothing I’ve ever seen before and the ebb and flow of people and animals in and out of each other’s lives is constant. It is its own ecosystem of sorts. Eid al-Fitr, the celebration at the end of Ramadan and known as “djoulde” in Pulaar, sees every compound in my village blend into the next. We all dress up in our best complets and migrate from household to household, asking forgiveness for wrongs done in the past year and giving blessings for the new. The children run wild in hoards, muddying their new clothes, and the women help each other slicing up the mounds of onions to be turned into onion sauce. Extended families kill a cow and split up the parts between people and households; sometimes one cow feeds one hundred people and four households. Community is evident outside of the holidays too. One of the first things I got over fast when I moved to Senegal was a need for personal space and privacy. Although I have my own hut and bathroom space it’s almost always too hot to spend any time in, let alone sleep in. It mostly hosts my lizard roommates ten months out of the year and I only kick them out when it gets down to 65 degrees outside at night in the cold season (which lasts all of seven days). This means we do EVERYTHING together. I eat breakfast outside in a central area between the houses of the compound with 25 other people; I eat lunch and dinner there too. I take a nap next to a horse under a tree while a neighbor walks buy selling fresh milk and I wake up to a goat nibbling on my shirt, a child climbing on my back, and a farmer in my face who wants me to come look at his corn. At first, I found the culture of community in my village overwhelming. If I went to the corner shop 100 yards from the front door of our compound and brought two eggs, one of my scholarship girls who lives across the village would ask me the how my omelet was the next day. Everyone had an opinion on my work or my language skills, even if I had never met them or talked to them before. People heard about it from their brother/mom/grandmother/sixth cousin. Despite the lack of privacy in this life I have now, the sense of community in our 3,000-person village (all packed into a stretch of land about a half mile long) is something I cherish. Now, when someone asks me about the eggs I bought yesterday I ask them about the extra loaf of bread they ordered. I love that I can walk into any compound in my village just to say hi and stay for the whole day without anyone asking me what I want. We might get nosy and people definitely get in fights over goat damage to gardens, but I don’t know any place else where a couple thousand people can comfortably call each other family and know each other well enough to really mean it. The openness of my village community is something I’m happy to have gained during my time in Peace Corps and always want to retain. Maybe not to the extent of knowing my neighbor’s grocery list but in the ability to know the people around me well and foster an environment of mutual support. These individual threads of connection to other people are so incredibly important to our society, yet so undervalued in the fast-paced environment much of the world lives in today. As I move toward the next stage of my life I want to take time to appreciate community and bring it with me wherever I go."
                },
                {
                    "blogTitle":"Christine Bedenis",
                    "postTitle":"Northern Lights FLashing in Michigan",
                    "post":"Went I went up to Isle Royale in September, I had dreams of seeing the aurora borealis lighting up the night sky. I had done my research and  knew that they were most active around 10-11 p.m. and just before dawn in the morning and that around the equinoxes was also a time of high activity. However, I failed to account for the fact that I would be hiking an average of 10 miles a day with a 30-pound pack and that with the lack of electric lights that I would be sound asleep by at those times. I think I may have seen them one early morning, having been woken up by bright flashes in the sky, but I’m not entirely sure. I got a second chance earlier this week though, when some kind of solar storm kicked up the solar winds enough to knock the Northern Lights a bit further south than usual. First my mom mentioned it to me, at about 8 p.m., too late to get anywhere away from the light pollution of metro Detroit, and so I brushed it off. However, the next day a friend shared the same information for that evening and asked if anyone was game to go sky watching. I jumped on the opportunity and arranged to head out his way, and we agreed that Little Sable Point would be perfect; it’s pretty far from most major sources of light pollution, jutting out into Lake Michigan a bit and has an excellent view of the northern horizon. We set up shop around 8 p.m. on the dunes, getting started just doing some astrophotography and my friend experimented with doing some light painting with the lighthouse there. Around 10 p.m. I noticed that there was a pillar of faint light coming up off the horizon over the lake, and that there was a light fog all along the horizon. We both aimed our cameras, clicked the shutter and sure enough, the tell-tale green of the aurora borealis was there. I was so giddy as I began to notice the faint pillars appear and move across the horizon and then seeing what my camera captured. I’ll stop trying to describe it and let my pictures and timelapse do the talking."
                },
                {
                    "blogTitle":"Mensajes from the Dominican Republic",
                    "postTitle":"On the nights that change you forever",
                    "post":"This is the kind of night that changes a person forever. It started out like any other Saturday night in Manzanillo, but soon became more raucous than most because we had patron saint celebrations in town and some no-name dembow artist with Barbie-like proportions took the stage while a crowd of drunk onlookers grinded with each other in groups around bottles of rum. Milka left the stage around midnight and the masses made their way to the local bar to dance.  I was dancing to a nice Romeo song when the music turned down suddenly. The crowd erupted – “TURN UP THE MUSIC” and for a brief second it did and my partner and I went back to dancing. Then suddenly, the music shut off and the DJ announced over the microphone that he was closing for the night, and told the men to 'take their ladies home'. The whole place was confused and in uproar, it was 2am. My friend Anny grabbed me by the hand and yelled to me to follow her. With the rest of the crowd and optics of a flowing river, went hundreds of people running in unison toward the street. I asked what was going on and someone mentioned “accident, dead, kids, motorcycle” but I couldn’t piece it all together, I just followed the crowd. I arrived to the hospital with over 500 Dominicans crowding the emergency room door. As in all confusing situations, people we crying, speculating, screaming, rushing the door and trying to get in. It was utter chaos - terrifying, terrible and heartbreaking. Two days later, we’re still trying to piece it all together, but from my best guess, this is what happened: Two boys were at the Patronales festival and left in their motorcycle heading the 9km home when they crashed into an unlit semi-truck stopped on the side of the road. The first to the scene were trained paramedics in the town ambulance. They loaded the boys into the back and jetted off the hospital. Upon arrival, someone yelled to them to go back, that an accident happened. “We know, we know, we’re bringing the patients here,” said Alexis. “No,” said the onlooker, “Another two just crashed, hurry!” Apparently, the culprit semi-truck backed up to make room for the ambulance and that’s when another motorcycle with two boys from Montecristi also crashed into the same unlit semi-truck.Two identical accidents within a span of 45 minutes. Of the four, two were dead on impact. One of the boys died in the ambulance in the hands of our trained paramedic Alexis (in his words, “I felt when the soul was taken out of him, he was just gone.”) The final victim is still in critical condition in the city of Santiago. Alexis said when he got to the hospital with the second two, he could barely work because so many people were crowding the ambulance and tapping the window to see in. “Savages,” he kept saying over and over. In the chaos of the crowd and frenzy at the hospital, I ran right away back to the house and put my “leader” shirt on and ran back to the hospital to do crowd control. I knew trained first responders were in the emergency room with the critical patients and would need a space to get the stretcher into the ambulance parked outside, but there were at least 100 people standing in the ten feet between the door and the ambulance. As best I could, with the help of another paramedic, Anny, we got the crowd back and the stretcher into the hospital and the jet off. Then it was up to us to deal with the screaming, crying, yelling, fainting and crazed onlookers. I was trying so hard to keep it all together, to prevent people from blocking the hospital door, prevent footage from being recorded, help screaming friends of the victims, control the rumors already spreading like wildfire. I’m not sure I did a very effective job, but I was doing what I could.   And then a moment changed all that. A friend from Copey approached me to say, “Bea, you know it was Enmanuel and Yunior who died, right?” I couldn’t breathe, it couldn’t be. My students? The boys who just helped me build a chimney for the stove in his mother’s house? No! No! No! And then, a tear slipped out, but before I could completely break down, another friend came up to me and yelled, “YOU CANNOT ACT NERVOUS, GET IT TOGETHER,” and I had to regain my composure and put it all back together inside and out with the burden of knowing the victims well. I had hours to go before I could walk home, crash in bed, break down and cry. Eventually, I decided it was time to go inside the emergency room and piece together what information I could from the doctors. Never before have I seen such ugliness. The two boys...my students...laying face up in hospital stretchers with sheets over their faces...they’re really dead? No! No! No! I watched as the fathers of the boys came to confirm their sons’ identities. “Si,” they wailed, “es mi’jo, mi’jo...mi’jo.” I approached the hospital director who just said with a blank face, “Oh Bea, oh Bea, you’re here, thank you.” I felt paralyzed.  This night was hard for me to varying degrees and on multiple levels. First, I have never seen dead bodies, let alone those of my students, and two of them, faces up, bodies destroyed and faces indistinguishable. Beyond that, I was in the emergency room with them for more than an hour, so to see the two corpses for so many hours of the night, and then more vile images from friends who sent me photos afterward was more blood and guts then I bargained for.  Secondly, I had to search deep and summon all my courage and motivation to lead in a situation like this. I don’t have a medical background, Spanish is my second language, and a part of me kept nagging my subconscious, wtf am I doing here? The only answer I can come up with is that someone had to do it. And in emergencies, it’s not those in charge that tend to lead, it’s those who are there. But let me tell you, when I finally dragged my ass into bed at 4am, I let loose and cried harder than I’ve cried in recent memory. Life is unfair. Finally, I was very affected on an emotional level (better word might be crushed) because it was Enmanuel and Yunior up on those stretchers. Two boys who I’ve taught and learned from, cared about and motivated. Sending condolences, my best friend and fellow teacher, Emily, texted me to say, “I believe (in all my 24 years of wisdom) that the closest approximation to the loss of your own child is the loss of your student. Maybe I’m naïve, but all I know is that for a period of time, they are your children. I am so sorry.” It hit me so hard when she texted, it made perfect sense, of course that’s why I feel like I just got crushed with a cinderblock, because they were my loving, living, learning students. Reeling from aftermath of this accident, I have seen a strange combination of reactions from townsfolk. Some people are sad and although they didn’t know the families, they grieve as if they did. Tragedy struck, let’s all shed tears together. But then there are some that just want to get pictures of the accident and have been going around town in a perverted hunt for images of the night. Then they WhatsApp then en masse to others. The fact that a someone from New York, a cousin of a Manzanillo friend knew about the accident before she did, is proof (sometimes social media is too effective). And then there are those who act like I’m losing it for being upset two days later. But Bea, it wasn’t your fault, get over it already. Well of course it wasn’t my fault, but it is still an awful burden to bear. “Let me feel what I need to feel,” I want to yell, “Let me be alone when I need to, or with you when I don’t. Let me eat ice cream and dance in your kitchen to take my mind off it. Let me clean my house from top to bottom just to not have to think about it all. Let me nap at 4pm. Let me cry. But please, just hug me when I tell you to.”   Yes, today was better, every day it's getting better, it’s been three days. I don’t know what tomorrow brings, but I’ll be okay, humans are resilient, especially in the face of tragedy, we all just need our time, there's no one right way to grieve. We were a community before, but we’ve come together now, and will emerge stronger. We have to, for Enmanuel and Yunior, we will. I hope the visions and nightmares of that night go away, but there are some sights that cannot be unseen. Instead I’ll try to remember their smiling faces, tiguere spirits and raucous laughter because that’s what they deserve. May they rest in peace."
                },
                {
                    "blogTitle":"Mensajes from the Dominican Republic",
                    "postTitle":"On life as I know it",
                    "post":"Saududos! Sooooooo...what a whirlwind. Life here never really slows down for me even though I keep fully expecting to settle into the tranquil Dominican pace of life. As a friend recently wrote in an email- 'I hope your finding a balance between the DR way of life and the 'Bronwen at Tufts' pace.' Well I guess I've been more on the Bronwen at Tufts pace, but I wouldn't have it any other way. Get back to me in two years and maybe I'll have settled into your average porch sitting, sun avoiding, rain fearing, exercise hating doña but it’s doubtful! So what have I been up to? Well, since we last spoke, I've been trying creative ways to engage more youth in my Escojo Mi Vida club. My club has around fifteen youth signed up (good start!) but only about six or seven regularly attend the (super fun) meetings. I'm not very jazzed about their absences so I'm working on creating accountability to attend. And I was feeling especially down when two of the young girls in the original crew ya se casaron (had sex for the first time) with their boyfriends and are now living with their “husbands” as they call them here. So frustrating! If only I could have gotten them a few weeks earlier. But I’ve been much too hard on myself and I must simply remind myself, I can’t help everyone and such is life. What I want to do now is make sure they stay in the group and at least have safe sex (read: condoms condoms condoms condoms). A few ideas for motivating my community members- 1) I'm going to shamelessly start using Facebook to tag photos/add events and make my group look like the funnest thing ever so please excuse me if I begin to blow up y'all's news feed. 2) Also thinking a beach day with espaggetis, but I'm hesitant to reward kids for not even coming to my group yet.  In a "what’s in it for me" type culture, reward for simple attendance is almost required (hence Taina sending a package of trinkets, candy, lip gloss, etc for me to use as raffle prizes) 3) Rely on my project partner to help recruit and animate the kids (I’ve always been bad at delegating but this is good practice(?!)) 4) Be more fun and cool (as if it's possible!) If you have any other creative ideas- send me some options! I'm all ears. Well all these creative ideas took a spot on the back burner because....I got food poisoning! It happened the same day a good friend, Julie, from another town was visiting as we were to run an 18k training run for her upcoming half marathon. Needless to say, I didn't put my running shoes on that morning or the next three. I stayed in bed as my host mom brought me soup and Gatorade and I sent Julie on a mission to find me meds and cancel my English classes. And when I felt better and made the rounds of town a few days later, literally ever person I passed asked if I was feeling better. Such a small town and I'm so glad they're so thoughtful. But before all the vomming, Julie and I also held a super successful workshop for fifteen women (and one cute little chubby kid) on how to conduct home visits are freshly minted health promoters in their community of Palo Verde. My best doña friend from my town, Yessenia, was also in attendance so that she can see the work will want to accomplish by June (fingers crossed!). Her and I work together in a town called Copey just a motorcycle ride away from Manzanillo. To date she has been the first person I've worked with to 'get it.' She is so motivated, highly competent, enthusiastic, energetic and inspirational to me and the other women in her community. I am so glad to have found a woman to work with who is off the charts in terms of helping me out. She makes my job so easy. But, what happened the same day I realized she will be my best friend and biggest helper? She told me she is probably moving to the city of Santiago (3 hours away) in June. When she told me, my mouth dropped and I wanted to scream NOOOOOOOOOOOOOOO at the top of my lungs until she agreed not to move. Eughhhhhh!!!! But good for her, I’m proud of her ability to gain more opportunities in the city and I'm now working extra hard with her so that she can take the program we started together to women in Santiago. And maybe, just maybe, (so Dios quiere) she won't move after all (cross your fingers for me)! And on Wednesday I picked up a bffl who went to school with me at Tufts who hope, skip and jumped on over for Spring Break. After her wild few days in Puerto Rico, I got to show her my tranquil lifestyle in the pueblito. It was so interesting (and wonderful, exciting and comforting) to have a friend from America visit because in those five days I realized how truly comfortable and Dominican I feel. She was shocked that I drink coffee out of plastic cups (talk about BPA), sometimes (rarely) litter on the street, can navigate myself through the big city, speak like a campesina (country bumpkin), live off a diet that is 90% carbs and fried food (I can't help it), not be obese (yet!), actually work here (sometimes I feel so lucky), have Dominican friends (amirite??), can joke about finding chicken feet in soup without wanting to barf, and eat a mango like a savage. It was wonderful to take her through the streets and show her my life that couldn't be more different than the one I led at Tufts. Thanks for the wonderful visit Linz! And I'm currently writing this on the bus after a three-day intensive cookstoves training. As I mentioned a few mensajes back, part of our project plan as health volunteers is to create at least 15 clay cookstoves that are culturally appropriate models for reducing the amount of firewood used to light and cook with, and removing smoke from cooking areas and subsequently the lungs of women and children. I loved the training and am very excited to start a project in my town but first, I have to write a grant and wait for funding, train a mason (my original mason ditched me 12 hours before we were supposed to leave), buy cement, sand and other complicated building materials, find the right houses to build in, train women on proper cooking and maintenance techniques, and motivate my community to support me in the process. It’s a HUGE project but one, that if I am successfully able to implement, will be extremely proud of myself for! Now I’m back at home after a busy morning of errand-running, trying to track down the mayor who wants me to represent the town of Manzanillo in a regional meeting with the director of the Ministry of Youth later this week, and doing laundry (it’s been quite some time since I washed my sheets, ewww gross!). And I'm off again this weekend to a town called San Francisco de Macoris for a youth conference on the environment where I will be MCing the event, leading 6am workout classes and planning a little healthy competition between youth groups. And then soon enough, the oldest group of volunteers end their service and another group is sworn in and I'm no longer a newbie. Time flies! Ah the circle of Peace Corps life."
                },
                {
                    "blogTitle":"Mensahes from the Dominican Republic",
                    "postTitle":"On sending me love letters",
                    "post":"I'm currently sitting in a hotel in Georgetown, DC as I prepare to depart for 27 months of service with the Peace Corps in the Dominican Republic! I left Idaho at the end of July and have been in Boston ever since. Thank you to the many who were/are concerned about the Beaver Creek Fire that has ravaged through our town this past week. My immediate family was evacuated from our home but are back now safe and sound. It's a weird feeling to turn on the national news and see images of my hometown burning. But alas, my town and people are safe and the fire is being controlled. Sending all my love and virtual hugs to those friends and family still in Idaho. (If you're interested in checking out some images of the fire, follow this link). The last few weeks have been a crazy mess of packing, spending time with friends and family, and saying the inevitable goodbyes. Everyone has been asking me how I feel about leaving. Well, I feel great! I am nervous and excited and everything in between. I'm a bit anxious but I suppose that's to be expected. At 12pm today, I will be heading to a conference room in Washington, DC to meet the other 49 volunteers who will be heading to the DR with me tomorrow. We will have a series of presentations and a mess of information thrown at us. And tomorrow at 4am, we depart for the airport and American Airlines Flight 1455 that will bring us all safe and sound to Santo Domingo, Dominican Republic. From there, we will head to a retreat center outside the capital for vaccines, information, training and mingling. Then on Thursday, I will return to Santo Domingo where I will meet my host family for the first ten weeks of service (fingers crossed they are half as good as my Spanish host family!). And then after three months of training in Santo Domingo, I will be given a position as a health worker in a rural village somewhere (yet to be determined) in the DR. My hope is to be in a village where I can work with women and young mothers, but the Peace Corps placement, from what I understand, it a total crapshoot. I've spoken to many others who have done/are doing the Peace Corps and the advice they give is keep an open mind and let go of expectations. It's sound advice, so I'm trying not to over think the process. Seems easy enough, eh? Can't wait!  When I arrive in the DR, I will have extremely limited access to internet/phones/modern technology. Be patient if you don't hear from me right away, I send an e-blast to you all as soon as possible but don't suspect I'm dead if you don't hear from me tomorrow. To keep in touch with me, you've got a few options. Email (bronwenraff@gmail.com), phone (that I will be getting after my first month in the DR), snail mail (see details below), and carrier pigeons. Take your pick or use them all, I would love to hear from you and find out what's new in your lives as well!    Next time we speak, I'll be in the DR. Wish me luck! Good vibes are always accepted!"
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                },
                {
                    "blogTitle":"",
                    "postTitle":"",
                    "post":
                }
            ]
        }
}